D=0.1/laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    empty
    {
        type            empty;
        physicalType    empty;
        nFaces          1818;
        startFace       12376;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          95;
        startFace       14194;
    }
    fixedwall
    {
        type            patch;
        physicalType    patch;
        nFaces          585;
        startFace       14289;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       14874;
    }
)

// ************************************************************************* //
